app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    if params[:sort].nil? && params[:ratings].nil? &&
        (!session[:sort].nil? || !session[:ratings].nil?)
      redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
    end

    @sort = params[:sort]
    @ratings = params[:ratings]
    if @ratings.nil?
      ratings = Movie.ratings
    else
      ratings = @ratings.keys
    end

    @all_ratings = Movie.ratings.inject(Hash.new) do |all_ratings, rating|
          all_ratings[rating] = @ratings.nil? ? false : @ratings.has_key?(rating)
          all_ratings
      end

    if !@sort.nil?
      begin
        @movies = Movie.order("#{@sort} ASC").find_all_by_rating(ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC

  def edit
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "10"]]